# Домашнее задание к работе 13

## Условие задачи
Составить программу, которая во введенной пользователем строке проверяет, есть ли в заданной строке слова, начинающиеся на букву 'a' (как строчную, так и заглавную), и выводит эти слова.

## 1. Алгоритм и блок-схема

### Алгоритм
1. **Начало**
2. Объявить переменные:
   - `str[200]` - массив для хранения введенной строки
   - `i` - индекс для перемещения по строке
   - `found` - флаг наличия слов на 'a' (0 - не найдено, 1 - найдено)
3. Ввести исходные данные:
   - Ввести строку с помощью `fgets()`
4. Инициализировать переменные:
   - `i = 0`
   - `found = 0`
5. Вывести заголовок: "Слова на 'a': "
6. Обработать строку:
   - Пока не достигнут конец строки (`str[i] != '\0`):
     - Проверить начало слова:
       - Если это начало строки (`i == 0`) или предыдущий символ пробел (`str[i-1] == ' '`)
       - Текущий символ 'a' или 'A'
     - Если условие выполняется:
       - Установить `found = 1`
       - Выводить символы слова до пробела, конца строки или перевода строки
       - Вывести пробел после слова
     - Перейти к следующему символу (`i++`)
7. Проверить результат:
   - Если `found == 0`, вывести "нет"
8. **Конец**

## 2. Реализация программы

```c
#define _CRT_SECURE_NO_DEPRECATE
#include <stdio.h>
#include <locale.h>

void func();

int main() {
    setlocale(LC_ALL, "");

    func();    

    return 0;
}

void func() {
    char str[200];

    printf("Введите строку: ");
    fgets(str, 200, stdin);

    printf("Слова на 'a': ");

    int found = 0;
    int i = 0;

    while (str[i] != '\0') {
        if ((i == 0 || str[i - 1] == ' ') && (str[i] == 'a' || str[i] == 'A')) {
            found = 1;

            while (str[i] != ' ' && str[i] != '\0' && str[i] != '\n') {
                printf("%c", str[i]);
                i++;
            }
            printf(" ");
        }
        i++;
    }

    if (found == 0) {
        printf("нет");
    }
}
```

## 3. Результаты работы программы

### Пример:
```
Введите строку: apple banana apricot cherry
Слова на 'a': apple apricot 
```

## 4. Информация о разработчике

Маркина Елена, группа бТИИ-251
